#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x7AE (0x7AE - 0x0)
// Function charBox.charBox_C.Init
struct UCharBox_C_Init_Params
{
public:
	struct FSlateColor                           K2Node_MakeStruct_SlateColor;                      // 0x0(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_1;                    // 0x28(0x28)(None)
	struct FItem                                 K2Node_MakeStruct_item;                            // 0x50(0x64)(HasGetValueTypeHash)
	uint8                                        Pad_75E[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FItem                                 K2Node_MakeStruct_item_1;                          // 0xB8(0x64)(HasGetValueTypeHash)
	uint8                                        Pad_75F[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FItem                                 K2Node_MakeStruct_item_2;                          // 0x120(0x64)(HasGetValueTypeHash)
	uint8                                        Pad_760[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FItem                                 K2Node_MakeStruct_item_3;                          // 0x188(0x64)(HasGetValueTypeHash)
	uint8                                        Pad_761[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FItem                                 K2Node_MakeStruct_item_4;                          // 0x1F0(0x64)(HasGetValueTypeHash)
	uint8                                        Pad_762[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FItem                                 K2Node_MakeStruct_item_5;                          // 0x258(0x64)(HasGetValueTypeHash)
	uint8                                        Pad_763[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FItem                                 K2Node_MakeStruct_item_6;                          // 0x2C0(0x64)(HasGetValueTypeHash)
	uint8                                        Pad_764[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FItem                                 K2Node_MakeStruct_item_7;                          // 0x328(0x64)(HasGetValueTypeHash)
	uint8                                        Pad_765[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FItem                                 K2Node_MakeStruct_item_8;                          // 0x390(0x64)(HasGetValueTypeHash)
	uint8                                        Pad_766[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CallFunc_Conv_StringToInt_ReturnValue;             // 0x3F8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_SwitchInteger_CmpSuccess;                   // 0x3FC(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Less_IntInt_ReturnValue;                  // 0x3FD(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_767[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FItem                                 K2Node_MakeStruct_item_9;                          // 0x400(0x64)(HasGetValueTypeHash)
	uint8                                        Pad_768[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FItem                                 K2Node_MakeStruct_item_10;                         // 0x468(0x64)(HasGetValueTypeHash)
	uint8                                        Pad_769[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FItem                                 K2Node_MakeStruct_item_11;                         // 0x4D0(0x64)(HasGetValueTypeHash)
	uint8                                        Pad_76A[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FItem                                 K2Node_MakeStruct_item_12;                         // 0x538(0x64)(HasGetValueTypeHash)
	uint8                                        Pad_76C[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FItem                                 K2Node_MakeStruct_item_13;                         // 0x5A0(0x64)(HasGetValueTypeHash)
	uint8                                        Pad_76D[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FItem                                 K2Node_MakeStruct_item_14;                         // 0x608(0x64)(HasGetValueTypeHash)
	uint8                                        Pad_76E[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FItem                                 K2Node_MakeStruct_item_15;                         // 0x670(0x64)(HasGetValueTypeHash)
	uint8                                        Pad_76F[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FItem                                 K2Node_MakeStruct_item_16;                         // 0x6D8(0x64)(HasGetValueTypeHash)
	uint8                                        Pad_770[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FItem                                 K2Node_MakeStruct_item_17;                         // 0x740(0x64)(HasGetValueTypeHash)
	uint8                                        Pad_772[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CallFunc_Conv_StringToInt_ReturnValue_1;           // 0x7A8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_SwitchInteger_CmpSuccess_1;                 // 0x7AC(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Less_IntInt_ReturnValue_1;                // 0x7AD(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x148 (0x148 - 0x0)
// Function charBox.charBox_C.ExecuteUbergraph_charBox
struct UCharBox_C_ExecuteUbergraph_charBox_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_77B[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UM2data_C*                             CallFunc_game_game;                                // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateBrush                           CallFunc_getCharImage_NewParam1;                   // 0x10(0x88)(None)
	struct FSlateBrush                           K2Node_MakeStruct_SlateBrush;                      // 0x98(0x88)(None)
	class FString                                CallFunc_dotNumberS_ReturnValue;                   // 0x120(0x10)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                  CallFunc_Conv_StringToText_ReturnValue;            // 0x130(0x18)(None)
};

}
}


