#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x64 (0x64 - 0x0)
// UserDefinedStruct item.item
struct FItem
{
public:
	int32                                        Id_3_8A1378AE453878F6B3289CBF20001A14;             // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Count_33_3BFB70C54CCDFDBA6A97628B7BC16466;         // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                Des_30_0B98AEAC4FAEE2547F226EA48BBAEA16;           // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                        E1_11_8E2D7AAD49898966EB9D8CACB30911ED;            // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        E2_13_D540C93D450B9083CBF25D9AD4026349;            // 0x1C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        E3_15_296BFAE040D4D4E71CAA409B729AF64F;            // 0x20(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        E4_17_B606E0A14EA9B7AE6D8B9BA71C6B127E;            // 0x24(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        E5_19_50ED31CB4EB3163D77FB568987797556;            // 0x28(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        O1_21_22C873084A6A9B557786EFAD1901EFC2;            // 0x2C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        O2_23_A67755AD4B805D2CDDD266919050A49C;            // 0x30(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        O3_25_2B2CF1304120193D0598E9AC17604D07;            // 0x34(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        O4_27_6F9476C0470D05715018798786EAB7C2;            // 0x38(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        O5_29_D8455EAB47F5A6B469257F9B8FA9F19A;            // 0x3C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Price_36_7FB77BBE4CBFED43621CDDB123CC9B52;         // 0x40(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1550[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDateTime                             Date_39_210E30F849F22665AC7259A659CD0515;          // 0x48(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                        Timesec_42_D546BF4447DEB24D37400AA80249BB66;       // 0x50(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsUsing_44_AEA2736E4BB257E96CFBD4955A6C4F23;       // 0x54(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1551[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        T1_48_809E12E345C017A06CED33A93461869A;            // 0x58(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        T2_51_80B5E93F4A6F8635CE59C7996B578C53;            // 0x5C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        T3_52_3B760CDF40D7292D6EE2149EF0B0C863;            // 0x60(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


