#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xA0 (0x310 - 0x270)
// WidgetBlueprintGeneratedClass ItemShopPay.ItemShopPay_C
class UItemShopPay_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x270(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UC_Button_C*                           C_Button;                                          // 0x278(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_33;                                          // 0x280(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_169;                                         // 0x288(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            ShowCoin;                                          // 0x290(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            ShowPrice;                                         // 0x298(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_window_C*                           W_window;                                          // 0x2A0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWrapBox*                              Wrap;                                              // 0x2A8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FPacket                               Packet;                                            // 0x2B0(0x28)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UPayBox_C*                             SelectedPay;                                       // 0x2D8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                LocTemp;                                           // 0x2E0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class UWebBrowser_C*                         browser;                                           // 0x2F0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         UseGooglePlay;                                     // 0x2F8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         UseIOS;                                            // 0x2F9(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         UseIOSPOS;                                         // 0x2FA(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_EC1[0x5];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                Langerim;                                          // 0x300(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UItemShopPay_C* GetDefaultObj();

	void OpenBrowser(const class FString& URL, class UM2data_C* CallFunc_game_game, class UWebBrowser_C* CallFunc_openWebBrowser_browser);
	void PayOk(const class FString& CallFunc_Gtext_text, const class FString& CallFunc_Gtext_text_1, const class FString& CallFunc_Concat_StrStr_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_1);
	enum class ESlateVisibility GetVisibility_0(bool CallFunc_IsValid_ReturnValue);
	void CloseWeb();
	void CheckWeb(bool CallFunc_IsValid_ReturnValue, const class FString& CallFunc_GetUrl_url, bool CallFunc_Contains_ReturnValue);
	void Init(class UPayBox_C* CallFunc_Create_ReturnValue, class UM2data_C* CallFunc_game_game, class UM2data_C* CallFunc_game_game_1, bool CallFunc_NotEqual_StrStr_ReturnValue, bool CallFunc_EqualEqual_StrStr_ReturnValue, class UM2data_C* CallFunc_game_game_2, bool CallFunc_EqualEqual_StrStr_ReturnValue_1, bool CallFunc_Conv_IntToBool_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_Conv_IntToBool_ReturnValue_1, class UM2data_C* CallFunc_game_game_3, bool CallFunc_BooleanAND_ReturnValue_1, bool CallFunc_EqualEqual_StrStr_ReturnValue_2, bool CallFunc_Conv_IntToBool_ReturnValue_2, class UPanelSlot* CallFunc_AddChild_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_2, int32 Temp_int_Variable, int32 CallFunc_Multiply_IntInt_ReturnValue, int32 CallFunc_Multiply_IntInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_2, int32 CallFunc_Add_IntInt_ReturnValue_3, int32 CallFunc_Add_IntInt_ReturnValue_4, const struct FPacket& CallFunc_removeFirstIntFromPacket_pack, const struct FPacket& CallFunc_removeFirstIntFromPacket_pack_1, const struct FPacket& CallFunc_removeFirstIntFromPacket_pack_2, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, bool CallFunc_LessEqual_IntInt_ReturnValue);
	void OnFailure_7AA6B45744E2E2A564B463A8880238B8(enum class EInAppPurchaseState CompletionStatus, TArray<struct FInAppPurchaseRestoreInfo>& InAppRestorePurchaseInformation);
	void OnSuccess_7AA6B45744E2E2A564B463A8880238B8(enum class EInAppPurchaseState CompletionStatus, TArray<struct FInAppPurchaseRestoreInfo>& InAppRestorePurchaseInformation);
	void OnFailure_9B24A8254958F248A017F8B13B72B62D(enum class EInAppPurchaseState PurchaseStatus, struct FInAppPurchaseProductInfo& InAppPurchaseReceipts);
	void OnSuccess_9B24A8254958F248A017F8B13B72B62D(enum class EInAppPurchaseState PurchaseStatus, struct FInAppPurchaseProductInfo& InAppPurchaseReceipts);
	void OnFailure_FDC88BAB48FB60ABFB12B8A897F910BE(enum class EInAppPurchaseStatus PurchaseStatus, TArray<struct FInAppPurchaseReceiptInfo2>& InAppPurchaseReceipts);
	void OnSuccess_FDC88BAB48FB60ABFB12B8A897F910BE(enum class EInAppPurchaseStatus PurchaseStatus, TArray<struct FInAppPurchaseReceiptInfo2>& InAppPurchaseReceipts);
	void BndEvt__ItemShopPay_w_window_K2Node_ComponentBoundEvent_0__close__DelegateSignature();
	void ProcOk();
	void CloseWeber();
	void Construct();
	void BndEvt__ItemShopPay_c_Button_K2Node_ComponentBoundEvent_1_click__DelegateSignature();
	void ExecuteUbergraph_ItemShopPay(int32 EntryPoint, bool CallFunc_EqualEqual_StrStr_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, enum class EInAppPurchaseState K2Node_CustomEvent_CompletionStatus, TArray<struct FInAppPurchaseRestoreInfo>& K2Node_CustomEvent_InAppRestorePurchaseInformation, TArray<struct FInAppPurchaseRestoreInfo>& Temp_struct_Variable, enum class EInAppPurchaseState Temp_byte_Variable, enum class EInAppPurchaseState K2Node_CustomEvent_PurchaseStatus_3, const struct FInAppPurchaseProductInfo& K2Node_CustomEvent_InAppPurchaseReceipts_3, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, enum class EInAppPurchaseState K2Node_CustomEvent_PurchaseStatus_2, const struct FInAppPurchaseProductInfo& K2Node_CustomEvent_InAppPurchaseReceipts_2, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, const struct FInAppPurchaseProductInfo& Temp_struct_Variable_1, enum class EInAppPurchaseState Temp_byte_Variable_1, const class FString& CallFunc_Concat_StrStr_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_3, const class FString& CallFunc_Concat_StrStr_ReturnValue_1, enum class EInAppPurchaseStatus K2Node_CustomEvent_PurchaseStatus_1, TArray<struct FInAppPurchaseReceiptInfo2>& K2Node_CustomEvent_InAppPurchaseReceipts_1, const class FString& CallFunc_Concat_StrStr_ReturnValue_2, const class FString& CallFunc_Concat_StrStr_ReturnValue_3, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_4, const class FString& CallFunc_Concat_StrStr_ReturnValue_4, enum class EInAppPurchaseStatus K2Node_CustomEvent_PurchaseStatus, TArray<struct FInAppPurchaseReceiptInfo2>& K2Node_CustomEvent_InAppPurchaseReceipts, const class FString& CallFunc_Concat_StrStr_ReturnValue_5, TArray<struct FInAppPurchaseReceiptInfo2>& Temp_struct_Variable_2, TArray<class FString>& K2Node_MakeArray_Array, int32 CallFunc_Array_LastIndex_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, const class FString& CallFunc_Conv_IntToString_ReturnValue, enum class EInAppPurchaseStatus Temp_byte_Variable_2, const class FString& CallFunc_Concat_StrStr_ReturnValue_6, const class FString& CallFunc_Concat_StrStr_ReturnValue_7, const class FString& CallFunc_Concat_StrStr_ReturnValue_8, const class FString& CallFunc_Concat_StrStr_ReturnValue_9, const class FString& CallFunc_Concat_StrStr_ReturnValue_10, const class FString& CallFunc_Concat_StrStr_ReturnValue_11, TArray<class FString>& K2Node_MakeArray_Array_1, const class FString& CallFunc_Gtext_text, class UM2data_C* CallFunc_game_game, TArray<class FString>& K2Node_MakeArray_Array_2, TArray<int32>& K2Node_MakeArray_Array_3, const class FString& CallFunc_Gtext_text_1, TArray<int32>& K2Node_MakeArray_Array_4, class UM2save_C* CallFunc_m2save_save, TArray<class FString>& K2Node_MakeArray_Array_5, const class FString& CallFunc_GetDefaultLanguage_ReturnValue, const struct FTimerHandle& CallFunc_K2_SetTimer_ReturnValue, class UM2data_C* CallFunc_game_game_1, bool CallFunc_IsValid_ReturnValue, const class FString& CallFunc_GetUrl_url, bool CallFunc_Contains_ReturnValue, bool CallFunc_Contains_ReturnValue_1, bool CallFunc_Contains_ReturnValue_2, bool CallFunc_BooleanOR_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_12, const class FString& CallFunc_Concat_StrStr_ReturnValue_13, bool CallFunc_isTr_tr_, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_5, class APlayerController* CallFunc_GetPlayerControllerFromID_ReturnValue, class UM2data_C* CallFunc_game_game_2, TArray<int32>& K2Node_MakeArray_Array_6, const class FString& CallFunc_Gtext_text_2, class UM2data_C* CallFunc_game_game_3, class APlayerController* CallFunc_GetPlayerControllerFromID_ReturnValue_1, bool CallFunc_EqualEqual_StrStr_ReturnValue_1, class UM2data_C* CallFunc_game_game_4, enum class EInAppPurchaseState K2Node_CustomEvent_CompletionStatus_1, TArray<struct FInAppPurchaseRestoreInfo>& K2Node_CustomEvent_InAppRestorePurchaseInformation_1, const class FString& CallFunc_Conv_IntToString_ReturnValue_1, const class FString& CallFunc_Gtext_text_3, const class FString& CallFunc_Concat_StrStr_ReturnValue_14, const struct FInAppPurchaseProductRequest& K2Node_MakeStruct_InAppPurchaseProductRequest, const struct FInAppPurchaseProductRequest2& K2Node_MakeStruct_InAppPurchaseProductRequest2, class UInAppPurchaseCallbackProxy* CallFunc_CreateProxyObjectForInAppPurchase_ReturnValue, TArray<struct FInAppPurchaseProductRequest>& K2Node_MakeArray_Array_7, class UInAppPurchaseRestoreCallbackProxy* CallFunc_CreateProxyObjectForInAppPurchaseRestore_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_2, TArray<int32>& K2Node_MakeArray_Array_8, class UM2data_C* CallFunc_game_game_5, class APlayerController* CallFunc_GetPlayerControllerFromID_ReturnValue_2, class UInAppPurchaseCallbackProxy2* CallFunc_CreateProxyObjectForInAppPurchase_ReturnValue_1, class ULoading_C* CallFunc_Create_ReturnValue, bool CallFunc_IsValid_ReturnValue_3);
};

}


