#pragma once

// Dumped with Dumper-7!

namespace SDK
{
	//---------------------------------------------------------------------------------------------------------------------
	// CLASSES
	//---------------------------------------------------------------------------------------------------------------------

	// 0x4C1 (0x89D1 - 0x8510)
	// BlueprintGeneratedClass m2data.m2data_C
	class UM2data_C : public UFmdata
	{
	public:
		struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x8510(0x8)(ZeroConstructor, Transient, DuplicateTransient)
		class ALoader* Loader;                                            // 0x8518(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		bool                                         TextTyping;                                        // 0x8520(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
		bool                                         HaveMsgbox;                                        // 0x8521(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
		uint8                                        Pad_FF0[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
		class UM2save_C* M2save;                                            // 0x8528(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class ULoginScreen_C* LoginMain;                                         // 0x8530(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		struct FVector                               NonPlayerPos;                                      // 0x8538(0xC)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		uint8                                        Pad_FF5[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
		class ACameraActor* CharSelectCamera;                                  // 0x8548(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		bool                                         Loginok;                                           // 0x8550(0x1)(Edit, BlueprintVisible, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor)
		uint8                                        Pad_FF6[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
		TArray<class UObject*>                       LoadedAssets;                                      // 0x8558(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
		bool                                         FirstLogin;                                        // 0x8568(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
		uint8                                        Pad_FF7[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
		class FString                                Platform;                                          // 0x8570(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
		class APControl_C* PlayerController;                                  // 0x8580(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class FString                                Lang2;                                             // 0x8588(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
		class AWheather_C* Wheather;                                          // 0x8598(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UUI_C* UiMain;                                            // 0x85A0(0x8)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		TArray<struct FInventory>                            Inv;                                               // 0x85A8(0x58)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, HasGetValueTypeHash)
		class USlot_C* HitSlot;                                           // 0x8600(0x8)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UWidget* HitWidget;                                         // 0x8608(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		bool                                         IsHitSlot;                                         // 0x8610(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
		uint8                                        Pad_FF8[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
		class USlot_C* DraggingSlot;                                      // 0x8618(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		bool                                         IsDragging;                                        // 0x8620(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
		bool                                         LastSlotStatus;                                    // 0x8621(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
		uint8                                        Pad_FF9[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
		struct FIitem                                DraggingItem;                                      // 0x8628(0x148)(Edit, BlueprintVisible, DisableEditOnInstance)
		bool                                         DroppingItem;                                      // 0x8770(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
		uint8                                        Pad_FFA[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
		class UTexture2D* EmptyTexture;                                      // 0x8778(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		TArray<struct FQuickSlot>                    QuickSlots;                                        // 0x8780(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
		int32                                        InvRowCount;                                       // 0x8790(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		int32                                        SlotCount;                                         // 0x8794(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		TArray<class USlot_C*>                       SkillSlots;                                        // 0x8798(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
		class UShopWindow_C* ShopWindow;                                        // 0x87A8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UPrivateShopView_C* PrivateShopView;                                   // 0x87B0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UCreateShop_C* CreateShop;                                        // 0x87B8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UDemirci_C* DemirciBox;                                        // 0x87C0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UMsgbox_C* DropWindow;                                        // 0x87C8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UTrade_C* TradeWindow;                                       // 0x87D0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UMobileUI_C* MobileUI;                                          // 0x87D8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		int32                                        PlayerInvCount;                                    // 0x87E0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		uint8                                        Pad_1000[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		class UMallView_C* MallView;                                          // 0x87E8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UObject* SelectedObject;                                    // 0x87F0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class USlot_C* SelectedShopSlot;                                  // 0x87F8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		TArray<struct FTimerHandle>                  Timers;                                            // 0x8800(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
		class UFishOnay_C* FishBox;                                           // 0x8810(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UTasbas_C* Tasbas;                                            // 0x8818(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		struct FRefine                               TasbasData;                                        // 0x8820(0x34)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
		uint8                                        Pad_1002[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		class UGroup_C* Group;                                             // 0x8858(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		TArray<int32>                                GroupAddedPlayers;                                 // 0x8860(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
		class UUserWidget* WsPanel;                                           // 0x8870(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UDialogue_C* Dialogue;                                          // 0x8878(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		bool                                         Dialoging;                                         // 0x8880(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
		uint8                                        Pad_1003[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		class UData_C* Data;                                              // 0x8888(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		bool                                         World;                                             // 0x8890(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
		uint8                                        Pad_1004[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		int32                                        MaxStackableCount;                                 // 0x8894(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		bool                                         SkillGet;                                          // 0x8898(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
		uint8                                        Pad_1006[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		int32                                        SkillGroup;                                        // 0x889C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		bool                                         SkillDataLoaded;                                   // 0x88A0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
		bool                                         GameInitStatus;                                    // 0x88A1(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
		bool                                         DraggingSkill;                                     // 0x88A2(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
		uint8                                        Pad_1008[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		TArray<struct FQuickSlot>                    Qs;                                                // 0x88A8(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
		bool                                         SkillInit;                                         // 0x88B8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
		uint8                                        Pad_1009[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		class UObject* MobileControl;                                     // 0x88C0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		TArray<class FString>                        _debugCorners;                                     // 0x88C8(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
		bool                                         _debugCornersPrinted;                              // 0x88D8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
		bool                                         PlayerAnim;                                        // 0x88D9(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
		uint8                                        Pad_100A[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		class UCharSelect_C* CharSelect;                                        // 0x88E0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class ANpc* RPlayer;                                           // 0x88E8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		TArray<int32>                                OtoPots;                                           // 0x88F0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
		class UMsgboxLogin_C* MsgboxLogin;                                       // 0x8900(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UOkeyGame_C* OkeyGame;                                          // 0x8908(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class AItemShopBack_C* ItemShop;                                          // 0x8910(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class ACameraActor* ItemShopCamera;                                    // 0x8918(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UUIhandler_C* UIhandler;                                         // 0x8920(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		bool                                         IsGM;                                              // 0x8928(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
		uint8                                        Pad_1010[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		int32                                        Channel;                                           // 0x892C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UCostumeAttr_C* CostumeAttr;                                       // 0x8930(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class FString                                LocTemp;                                           // 0x8938(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
		TArray<class ACharView*>                     CharSelectChars;                                   // 0x8948(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
		class USmsVerify_C* Smser;                                             // 0x8958(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class FString                                Str1;                                              // 0x8960(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
		class UItemShopPay_C* ItemShopPay;                                       // 0x8970(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		struct FDateTime                             DragTime;                                          // 0x8978(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
		bool                                         IsCinematicMode;                                   // 0x8980(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
		uint8                                        Pad_1013[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		class UActorName_C* PlayerMeName;                                      // 0x8988(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		TArray<class UActorNameMob_C*>               MobMenames;                                        // 0x8990(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
		TArray<class UActorNameRPlayer_C*>           PlayerMeNames;                                     // 0x89A0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
		FMulticastInlineDelegateProperty_            Unfocus;                                           // 0x89B0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
		int32                                        ItemShopOpenCatId;                                 // 0x89C0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		uint8                                        Pad_1016[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		class USettings_C* Settings;                                          // 0x89C8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		bool                                         SaveLoaded;                                        // 0x89D0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

		static class UClass* StaticClass();
		static class UM2data_C* GetDefaultObj();

