#pragma once

// Dumped with Dumper-7!

namespace SDK
{
	//---------------------------------------------------------------------------------------------------------------------
	// CLASSES
	//---------------------------------------------------------------------------------------------------------------------

	// 0x23FC (0x280C - 0x410)
	// AnimBlueprintGeneratedClass playerAnim.playerAnim_C
	class UPlayerAnim_C : public UPlayerAnimer
	{
	public:
		struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x410(0x8)(ZeroConstructor, Transient, DuplicateTransient)
		struct FAnimNode_Root                        AnimGraphNode_Root;                                // 0x418(0x30)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_106;                // 0x448(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_105;                // 0x470(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_104;                // 0x498(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_103;                // 0x4C0(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_102;                // 0x4E8(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_101;                // 0x510(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_100;                // 0x538(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_99;                 // 0x560(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_98;                 // 0x588(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_97;                 // 0x5B0(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_96;                 // 0x5D8(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_95;                 // 0x600(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_94;                 // 0x628(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_93;                 // 0x650(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_92;                 // 0x678(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_91;                 // 0x6A0(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_90;                 // 0x6C8(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_89;                 // 0x6F0(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_88;                 // 0x718(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_87;                 // 0x740(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_86;                 // 0x768(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_85;                 // 0x790(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_84;                 // 0x7B8(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_83;                 // 0x7E0(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_82;                 // 0x808(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_81;                 // 0x830(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_80;                 // 0x858(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_79;                 // 0x880(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_78;                 // 0x8A8(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_77;                 // 0x8D0(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_76;                 // 0x8F8(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_75;                 // 0x920(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_74;                 // 0x948(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_73;                 // 0x970(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_72;                 // 0x998(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_71;                 // 0x9C0(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_70;                 // 0x9E8(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_69;                 // 0xA10(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_68;                 // 0xA38(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_67;                 // 0xA60(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_66;                 // 0xA88(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_65;                 // 0xAB0(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_64;                 // 0xAD8(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_63;                 // 0xB00(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_62;                 // 0xB28(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_61;                 // 0xB50(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_60;                 // 0xB78(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_59;                 // 0xBA0(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_58;                 // 0xBC8(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_57;                 // 0xBF0(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_56;                 // 0xC18(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_55;                 // 0xC40(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_54;                 // 0xC68(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_53;                 // 0xC90(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_52;                 // 0xCB8(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_51;                 // 0xCE0(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_50;                 // 0xD08(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_49;                 // 0xD30(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_48;                 // 0xD58(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_47;                 // 0xD80(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_46;                 // 0xDA8(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_45;                 // 0xDD0(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_44;                 // 0xDF8(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_43;                 // 0xE20(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_42;                 // 0xE48(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_41;                 // 0xE70(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_40;                 // 0xE98(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_39;                 // 0xEC0(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_38;                 // 0xEE8(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_37;                 // 0xF10(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_36;                 // 0xF38(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_35;                 // 0xF60(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_34;                 // 0xF88(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_33;                 // 0xFB0(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_32;                 // 0xFD8(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_31;                 // 0x1000(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_30;                 // 0x1028(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_29;                 // 0x1050(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_28;                 // 0x1078(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_27;                 // 0x10A0(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_26;                 // 0x10C8(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_25;                 // 0x10F0(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_24;                 // 0x1118(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_23;                 // 0x1140(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_22;                 // 0x1168(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_21;                 // 0x1190(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_20;                 // 0x11B8(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_19;                 // 0x11E0(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_18;                 // 0x1208(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_17;                 // 0x1230(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_16;                 // 0x1258(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_15;                 // 0x1280(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_14;                 // 0x12A8(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_13;                 // 0x12D0(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_12;                 // 0x12F8(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_11;                 // 0x1320(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_10;                 // 0x1348(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_9;                  // 0x1370(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_8;                  // 0x1398(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_7;                  // 0x13C0(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_6;                  // 0x13E8(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_5;                  // 0x1410(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_4;                  // 0x1438(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_3;                  // 0x1460(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_2;                  // 0x1488(0x28)(None)
		struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_21;                   // 0x14B0(0x80)(None)
		struct FAnimNode_StateResult                 AnimGraphNode_StateResult_22;                      // 0x1530(0x30)(None)
		struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_20;                   // 0x1560(0x80)(None)
		struct FAnimNode_StateResult                 AnimGraphNode_StateResult_21;                      // 0x15E0(0x30)(None)
		struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_19;                   // 0x1610(0x80)(None)
		struct FAnimNode_StateResult                 AnimGraphNode_StateResult_20;                      // 0x1690(0x30)(None)
		struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_18;                   // 0x16C0(0x80)(None)
		struct FAnimNode_StateResult                 AnimGraphNode_StateResult_19;                      // 0x1740(0x30)(None)
		struct FAnimNode_StateResult                 AnimGraphNode_StateResult_18;                      // 0x1770(0x30)(None)
		struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_17;                   // 0x17A0(0x80)(None)
		struct FAnimNode_StateResult                 AnimGraphNode_StateResult_17;                      // 0x1820(0x30)(None)
		struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_16;                   // 0x1850(0x80)(None)
		struct FAnimNode_StateResult                 AnimGraphNode_StateResult_16;                      // 0x18D0(0x30)(None)
		struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_15;                   // 0x1900(0x80)(None)
		struct FAnimNode_StateResult                 AnimGraphNode_StateResult_15;                      // 0x1980(0x30)(None)
		struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_14;                   // 0x19B0(0x80)(None)
		struct FAnimNode_StateResult                 AnimGraphNode_StateResult_14;                      // 0x1A30(0x30)(None)
		struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_13;                   // 0x1A60(0x80)(None)
		struct FAnimNode_StateResult                 AnimGraphNode_StateResult_13;                      // 0x1AE0(0x30)(None)
		struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_12;                   // 0x1B10(0x80)(None)
		struct FAnimNode_StateResult                 AnimGraphNode_StateResult_12;                      // 0x1B90(0x30)(None)
		struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_11;                   // 0x1BC0(0x80)(None)
		struct FAnimNode_StateResult                 AnimGraphNode_StateResult_11;                      // 0x1C40(0x30)(None)
		struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_10;                   // 0x1C70(0x80)(None)
		struct FAnimNode_StateResult                 AnimGraphNode_StateResult_10;                      // 0x1CF0(0x30)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_1;                  // 0x1D20(0x28)(None)
		struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult;                    // 0x1D48(0x28)(None)
		struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_9;                    // 0x1D70(0x80)(None)
		struct FAnimNode_StateResult                 AnimGraphNode_StateResult_9;                       // 0x1DF0(0x30)(None)
		struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_8;                    // 0x1E20(0x80)(None)
		struct FAnimNode_StateResult                 AnimGraphNode_StateResult_8;                       // 0x1EA0(0x30)(None)
		struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_7;                    // 0x1ED0(0x80)(None)
		struct FAnimNode_StateResult                 AnimGraphNode_StateResult_7;                       // 0x1F50(0x30)(None)
		struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_6;                    // 0x1F80(0x80)(None)
		struct FAnimNode_StateResult                 AnimGraphNode_StateResult_6;                       // 0x2000(0x30)(None)
		struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_5;                    // 0x2030(0x80)(None)
		struct FAnimNode_StateResult                 AnimGraphNode_StateResult_5;                       // 0x20B0(0x30)(None)
		struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_4;                    // 0x20E0(0x80)(None)
		struct FAnimNode_StateResult                 AnimGraphNode_StateResult_4;                       // 0x2160(0x30)(None)
		struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_3;                    // 0x2190(0x80)(None)
		struct FAnimNode_StateResult                 AnimGraphNode_StateResult_3;                       // 0x2210(0x30)(None)
		struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_2;                    // 0x2240(0x80)(None)
		struct FAnimNode_StateResult                 AnimGraphNode_StateResult_2;                       // 0x22C0(0x30)(None)
		struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_1;                    // 0x22F0(0x80)(None)
		struct FAnimNode_StateResult                 AnimGraphNode_StateResult_1;                       // 0x2370(0x30)(None)
		struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer;                      // 0x23A0(0x80)(None)
		struct FAnimNode_StateResult                 AnimGraphNode_StateResult;                         // 0x2420(0x30)(None)
		struct FAnimNode_StateMachine                AnimGraphNode_StateMachine;                        // 0x2450(0xB0)(None)
		class UAnimSequence* _wait;                                             // 0x2500(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _waitSword;                                        // 0x2508(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _run;                                              // 0x2510(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _runSword;                                         // 0x2518(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _damge;                                            // 0x2520(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _attack1;                                          // 0x2528(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _attack2;                                          // 0x2530(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _attack3;                                          // 0x2538(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _attack4;                                          // 0x2540(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _attackNoSword;                                    // 0x2548(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _drop;                                             // 0x2550(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _dropUp;                                           // 0x2558(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _dead;                                             // 0x2560(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _horseWait;                                        // 0x2568(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _horseRun;                                         // 0x2570(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _horseWait2;                                       // 0x2578(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _horseWait3;                                       // 0x2580(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _horseDamge;                                       // 0x2588(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _horseDead;                                        // 0x2590(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _horseAttack1;                                     // 0x2598(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _horseAttack2;                                     // 0x25A0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _horseAttack3;                                     // 0x25A8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _horseAttack4;                                     // 0x25B0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _attack1_2;                                        // 0x25B8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _attack2_2;                                        // 0x25C0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _attack3_2;                                        // 0x25C8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _attack4_2;                                        // 0x25D0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _damge_2;                                          // 0x25D8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _waitSword_2;                                      // 0x25E0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _runSword_2;                                       // 0x25E8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _skill1;                                           // 0x25F0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _skill2;                                           // 0x25F8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _skill3;                                           // 0x2600(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _skill4;                                           // 0x2608(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _skill5;                                           // 0x2610(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _skill6;                                           // 0x2618(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _skill1_0;                                         // 0x2620(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _skill2_0;                                         // 0x2628(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _skill3_0;                                         // 0x2630(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _skill4_0;                                         // 0x2638(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _skill5_0;                                         // 0x2640(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _run_a;                                              // 0x2648(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _runSword_a;                                         // 0x2650(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _wait_a;                                             // 0x2658(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _waitSword_;                                        // 0x2660(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _attackNoSword_a;                                    // 0x2668(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _attack1_a;                                          // 0x2670(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _attack2_a;                                          // 0x2678(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _attack3_a;                                          // 0x2680(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _attack4_a;                                          // 0x2688(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _drop_a;                                             // 0x2690(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _dropUp_a;                                           // 0x2698(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _dead_a;                                             // 0x26A0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _damge_a;                                            // 0x26A8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _skill1_a;                                           // 0x26B0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _skill2_a;                                           // 0x26B8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _skill3_a;                                           // 0x26C0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _skill4_a;                                           // 0x26C8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _skill5_a;                                           // 0x26D0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		bool                                         OnAttack_a;                                          // 0x26D8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
		bool                                         NextAttack_a;                                        // 0x26D9(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
		bool                                         DropUpOk;                                          // 0x26DA(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
		bool                                         EndAttack;                                         // 0x26DB(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
		bool                                         RestartAttack;                                     // 0x26DC(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
		bool                                         SendLoce;                                          // 0x26DD(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
		uint8                                        Pad_117F[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		class FString                                Status;                                            // 0x26E0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
		TArray<int32>                                SkillMoves;                                        // 0x26F0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
		class UM2data_C* Game;                                              // 0x2700(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class AActor* _roderFishing;                                     // 0x2708(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		bool                                         EndFishNow;                                        // 0x2710(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
		uint8                                        Pad_1180[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		float                                        AttackRate;                                        // 0x2714(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		float                                        SkillRate;                                         // 0x2718(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		float                                        WaitRate;                                          // 0x271C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		bool                                         DropUpNow;                                         // 0x2720(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
		uint8                                        Pad_1181[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		class USlot_C* TransingSkillSlot;                                 // 0x2728(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class FString                                LastCheckWeapon;                                   // 0x2730(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
		int32                                        LastCheckSkillGroup;                               // 0x2740(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		float                                        Attack1Remain;                                     // 0x2744(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		float                                        Attack2Remain;                                     // 0x2748(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		float                                        Attack3Remain;                                     // 0x274C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		float                                        Attack4Remain;                                     // 0x2750(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		float                                        Attack4Multiplier;                                 // 0x2754(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		float                                        HorseAttackAnimTrnas1;                             // 0x2758(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		float                                        HorseAttackAnimTrnas2;                             // 0x275C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		float                                        HorseAttackRate;                                   // 0x2760(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		uint8                                        Pad_1182[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		class UAnimSequence* _skill6_0;                                         // 0x2768(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _fish_wait;                                        // 0x2770(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _fish_catch;                                       // 0x2778(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _fish_fail;                                        // 0x2780(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _skill6_a;                                           // 0x2788(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _fish_Wait;                                        // 0x2790(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _fish_catch_a;                                       // 0x2798(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _fish_fail_;                                        // 0x27A0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _fish_throw;                                       // 0x27A8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _fish_throw_a;                                       // 0x27B0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _fish_wait_wait;                                   // 0x27B8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _fish_run;                                         // 0x27C0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _fish_wait_wait_a;                                   // 0x27C8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		class UAnimSequence* _fish_run_a;                                         // 0x27D0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		float                                        Attack1Multiplier;                                 // 0x27D8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		float                                        Attack2Multiplier;                                 // 0x27DC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		float                                        Attack3Multiplier;                                 // 0x27E0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
		uint8                                        Pad_1189[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
		struct FDateTime                             LastAttacked;                                      // 0x27E8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
		class FString                                LastSendAttackId;                                  // 0x27F0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
		struct FDateTime                             LastSendAttack;                                    // 0x2800(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
		int32                                        LastSendAttackCount;                               // 0x2808(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

		static class UClass* StaticClass();
		static class UPlayerAnim_C* GetDefaultObj();

		void AnimGraph(struct FPoseLink* AnimGraph);
		void ClearIfLocalTarget(class UM2data_C* CallFunc_game_game, bool CallFunc_EqualEqual_ObjectObject_ReturnValue);
		void SetAttackSpeed(int32 Aspeed, float Ratio, float CallFunc_Conv_IntToFloat_ReturnValue, float CallFunc_Divide_FloatFloat_ReturnValue, const class FString& CallFunc_Conv_FloatToString_ReturnValue, bool CallFunc_EqualEqual_StrStr_ReturnValue, float CallFunc_FMin_ReturnValue, const struct FCharData& CallFunc_char_NewParam);
