#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x1D9 (0x449 - 0x270)
// WidgetBlueprintGeneratedClass settings.settings_C
class USettings_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x270(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UC_Button_C*                           One20fps;                                          // 0x278(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UC_Button_C*                           Three0fps;                                         // 0x280(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UC_Button_C*                           Six0fps;                                           // 0x288(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UC_Button_C*                           blockFriend;                                       // 0x290(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UC_Button_C*                           blockGroup;                                        // 0x298(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UC_Button_C*                           blockGuild;                                        // 0x2A0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UC_Button_C*                           blockPm;                                           // 0x2A8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UC_Button_C*                           blockTrade;                                        // 0x2B0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UC_Button_C*                           blockWs;                                           // 0x2B8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UC_TextBox_C*                          C_TextBox;                                         // 0x2C0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UC_TextBox_C*                          C_TextBox_1;                                       // 0x2C8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UC_TextBox_C*                          C_TextBox_2;                                       // 0x2D0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UC_TextBox_C*                          C_TextBox_3;                                       // 0x2D8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UC_TextBox_C*                          C_TextBox_4;                                       // 0x2E0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UC_TextBox_C*                          C_TextBox_5;                                       // 0x2E8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UC_TextBox_C*                          C_TextBox_6;                                       // 0x2F0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UC_TextBox_C*                          C_TextBox_7;                                       // 0x2F8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UC_TextBox_C*                          C_TextBox_8;                                       // 0x300(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UC_TextBox_C*                          C_TextBox_9;                                       // 0x308(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UC_Button_C*                           FpsHigh;                                           // 0x310(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UC_Button_C*                           FpsLow;                                            // 0x318(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UC_Button_C*                           FpsMid;                                            // 0x320(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UC_Button_C*                           HavaClose;                                         // 0x328(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UC_Button_C*                           HavaOpen;                                          // 0x330(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                              MobileUIScale;                                     // 0x338(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            MuzText;                                           // 0x340(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            MuzText_1;                                         // 0x348(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            MuzText_2;                                         // 0x350(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UC_Button_C*                           PercantageHigh;                                    // 0x358(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UC_Button_C*                           PercantageLow;                                     // 0x360(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UC_Button_C*                           PercantageMax;                                     // 0x368(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UC_Button_C*                           PercantageMax_1;                                   // 0x370(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UC_Button_C*                           PercantageMid;                                     // 0x378(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UC_Button_C*                           ResHigh;                                           // 0x380(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                              ResLevelBox;                                       // 0x388(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UC_Button_C*                           ResLow;                                            // 0x390(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UC_Button_C*                           ResMax;                                            // 0x398(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UC_Button_C*                           ResMid;                                            // 0x3A0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USlider*                               SliderCamSpeed;                                    // 0x3A8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USlider*                               SliderEffect;                                      // 0x3B0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USlider*                               SliderMain;                                        // 0x3B8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USlider*                               SliderMobileUI;                                    // 0x3C0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USlider*                               SliderMusic;                                       // 0x3C8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            Text_camspeed;                                     // 0x3D0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            Text_camspeed_1;                                   // 0x3D8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_view_C*                             W_view;                                            // 0x3E0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_view_C*                             W_view_1;                                          // 0x3E8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_view_C*                             W_view_295;                                        // 0x3F0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_view_C*                             W_view_379;                                        // 0x3F8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_view_C*                             W_view_657;                                        // 0x400(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_view_C*                             W_view_942;                                        // 0x408(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_view_C*                             W_view_1103;                                       // 0x410(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_view_C*                             W_view_1257;                                       // 0x418(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_view_C*                             W_view_1556;                                       // 0x420(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_view_C*                             W_view_1713;                                       // 0x428(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_window_C*                           W_window;                                          // 0x430(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UW_window_C*                           W_window_114;                                      // 0x438(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UM2data_C*                             Game;                                              // 0x440(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         FirstInitOk;                                       // 0x448(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

	static class UClass* StaticClass();
	static class USettings_C* GetDefaultObj();

	void SetRainSound(float Val, class UM2data_C* CallFunc_game_game, float CallFunc_Divide_FloatFloat_ReturnValue);
	void SendBlockChange(int32 Type, TArray<class FString>& K2Node_MakeArray_Array, TArray<int32>& K2Node_MakeArray_Array_1, class UM2data_C* CallFunc_game_game);
	void SetBlocked(bool B, class UC_Button_C* but, const struct FSlateColor& K2Node_MakeStruct_SlateColor, const struct FSlateColor& K2Node_MakeStruct_SlateColor_1);
	void UpdateBlocks(const struct FPlayerSetting& Set);
	class FText Get_text_camspeed_Text_0(float CallFunc_GetValue_ReturnValue, int64 CallFunc_FTrunc64_ReturnValue, class FText CallFunc_Conv_Int64ToText_ReturnValue);
	class FText Get_muzText_2_Text_0(float CallFunc_GetValue_ReturnValue, int64 CallFunc_FTrunc64_ReturnValue, class FText CallFunc_Conv_Int64ToText_ReturnValue);
	class FText Get_muzText_Text_0(float CallFunc_GetValue_ReturnValue, int64 CallFunc_FTrunc64_ReturnValue, class FText CallFunc_Conv_Int64ToText_ReturnValue);
	class FText Get_muzText_1_Text_0(float CallFunc_GetValue_ReturnValue, int64 CallFunc_FTrunc64_ReturnValue, class FText CallFunc_Conv_Int64ToText_ReturnValue);
	void Start(bool CallFunc_isMobile_isMobile, class UM2data_C* CallFunc_game_game, bool CallFunc_NotEqual_StrStr_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, class UM2save_C* CallFunc_m2save_save);
	void CheckLowFps();
	void FirstInit(bool CallFunc_isMobile_isMobile, class UM2data_C* CallFunc_game_game, bool CallFunc_EqualEqual_StrStr_ReturnValue, bool CallFunc_BooleanAND_ReturnValue);
	void DoResLow(class UM2save_C* CallFunc_m2save_save);
	void DoResMax(class UM2save_C* CallFunc_m2save_save);
	void SetQualityLevel(int32 Level, bool K2Node_SwitchInteger_CmpSuccess, class UM2save_C* CallFunc_m2save_save, class UM2save_C* CallFunc_m2save_save_1, class UM2save_C* CallFunc_m2save_save_2, class UM2save_C* CallFunc_m2save_save_3);
	void Init(const struct FSlateColor& K2Node_MakeStruct_SlateColor, const struct FSlateColor& K2Node_MakeStruct_SlateColor_1, bool CallFunc_isMobile_isMobile, float CallFunc_GetValue_ReturnValue, class UM2save_C* CallFunc_m2save_save, float CallFunc_Multiply_IntFloat_ReturnValue, int64 CallFunc_FTrunc64_ReturnValue, class FText CallFunc_Conv_Int64ToText_ReturnValue, class UM2save_C* CallFunc_m2save_save_1, float CallFunc_Conv_IntToFloat_ReturnValue, int32 CallFunc_FTrunc_ReturnValue, bool K2Node_SwitchInteger_CmpSuccess, bool K2Node_SwitchInteger_CmpSuccess_1, class FText CallFunc_Conv_IntToText_ReturnValue, float CallFunc_Conv_IntToFloat_ReturnValue_1, float CallFunc_Conv_IntToFloat_ReturnValue_2, float CallFunc_Conv_IntToFloat_ReturnValue_3, float CallFunc_Conv_IntToFloat_ReturnValue_4);
	void SetRes(float Res, class UC_Button_C* but, bool CallFunc_IsValid_ReturnValue, const class FString& CallFunc_Conv_FloatToString_ReturnValue, const struct FSlateColor& K2Node_MakeStruct_SlateColor, const struct FSlateColor& K2Node_MakeStruct_SlateColor_1, class UM2save_C* CallFunc_m2save_save, class UM2save_C* CallFunc_m2save_save_1, const class FString& CallFunc_MakeLiteralString_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue);
	void SetHava(bool IsHide, class UM2save_C* CallFunc_m2save_save, class UM2data_C* CallFunc_game_game, const struct FSlateColor& K2Node_MakeStruct_SlateColor, const struct FSlateColor& K2Node_MakeStruct_SlateColor_1, const struct FSlateColor& K2Node_MakeStruct_SlateColor_2);
	void SetFps(int32 FPS, bool CallFunc_EqualEqual_IntInt_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue_1, const class FString& CallFunc_Conv_IntToString_ReturnValue, const struct FSlateColor& K2Node_MakeStruct_SlateColor, class UM2save_C* CallFunc_m2save_save, const class FString& CallFunc_MakeLiteralString_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue, const struct FSlateColor& K2Node_MakeStruct_SlateColor_1);
	void SetPercentage(int32 Val, class UC_Button_C* but, bool CallFunc_IsValid_ReturnValue, float CallFunc_Conv_IntToFloat_ReturnValue, const class FString& CallFunc_Conv_IntToString_ReturnValue, const struct FSlateColor& K2Node_MakeStruct_SlateColor, const struct FSlateColor& K2Node_MakeStruct_SlateColor_1, class UM2save_C* CallFunc_m2save_save, class UM2save_C* CallFunc_m2save_save_1, const class FString& CallFunc_MakeLiteralString_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue);
	void UpdateMusic(int32 Percent, class UM2save_C* CallFunc_m2save_save, class APlayerController* CallFunc_GetPlayerController_ReturnValue, class APControl_C* K2Node_DynamicCast_AsP_Control, bool K2Node_DynamicCast_bSuccess, int32 CallFunc_Multiply_IntInt_ReturnValue, int32 CallFunc_Divide_IntInt_ReturnValue, bool CallFunc_IsValid_ReturnValue, float CallFunc_Multiply_IntFloat_ReturnValue, float CallFunc_Divide_FloatFloat_ReturnValue);
	void SetTextureStream(float Res, const class FString& CallFunc_MakeLiteralString_ReturnValue, const class FString& CallFunc_Conv_FloatToString_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue);
	void SetTexture(float Res, const class FString& CallFunc_MakeLiteralString_ReturnValue, const class FString& CallFunc_Conv_FloatToString_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue);
	void BndEvt__settings_SliderMusic_K2Node_ComponentBoundEvent_11_OnMouseCaptureEndEvent__DelegateSignature();
	void BndEvt__settings_c_Button_K2Node_ComponentBoundEvent_12_click__DelegateSignature();
	void BndEvt__settings_c_Button_1_K2Node_ComponentBoundEvent_13_click__DelegateSignature();
	void BndEvt__settings_c_Button_2_K2Node_ComponentBoundEvent_14_click__DelegateSignature();
	void BndEvt__settings_c_Button_3_K2Node_ComponentBoundEvent_15_click__DelegateSignature();
	void BndEvt__settings_c_Button_4_K2Node_ComponentBoundEvent_16_click__DelegateSignature();
	void BndEvt__settings_percantageMid_K2Node_ComponentBoundEvent_17_click__DelegateSignature();
	void BndEvt__settings_percantageHigh_K2Node_ComponentBoundEvent_18_click__DelegateSignature();
	void BndEvt__settings_percantageMax_K2Node_ComponentBoundEvent_19_click__DelegateSignature();
	void BndEvt__settings_SliderMain_K2Node_ComponentBoundEvent_6_OnMouseCaptureEndEvent__DelegateSignature();
	void BndEvt__settings_SliderEffect_K2Node_ComponentBoundEvent_5_OnMouseCaptureEndEvent__DelegateSignature();
	void BndEvt__settings_30fps_K2Node_ComponentBoundEvent_0_click__DelegateSignature();
	void BndEvt__settings_60fps_K2Node_ComponentBoundEvent_1_click__DelegateSignature();
	void BndEvt__settings_havaClose_K2Node_ComponentBoundEvent_3_click__DelegateSignature();
	void BndEvt__settings_havaOpen_K2Node_ComponentBoundEvent_7_click__DelegateSignature();
	void BndEvt__settings_w_window_K2Node_ComponentBoundEvent_2__close__DelegateSignature();
	void Construct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void BndEvt__settings_blockPm_K2Node_ComponentBoundEvent_2_click__DelegateSignature();
	void BndEvt__settings_blockFriend_K2Node_ComponentBoundEvent_8_click__DelegateSignature();
	void BndEvt__settings_blockGroup_K2Node_ComponentBoundEvent_9_click__DelegateSignature();
	void BndEvt__settings_blockWs_K2Node_ComponentBoundEvent_10_click__DelegateSignature();
	void BndEvt__settings_blockTrade_K2Node_ComponentBoundEvent_20_click__DelegateSignature();
	void BndEvt__settings_blockGuild_K2Node_ComponentBoundEvent_21_click__DelegateSignature();
	void BndEvt__settings_sliderCamSpeed_K2Node_ComponentBoundEvent_22_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void BndEvt__settings_sliderCamSpeed_K2Node_ComponentBoundEvent_24_OnMouseCaptureEndEvent__DelegateSignature();
	void BndEvt__settings_60fps_1_K2Node_ComponentBoundEvent_23_click__DelegateSignature();
	void BndEvt__settings_SliderEffect_K2Node_ComponentBoundEvent_25_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void BndEvt__settings_sliderMobileUI_K2Node_ComponentBoundEvent_26_OnMouseCaptureEndEvent__DelegateSignature();
	void BndEvt__settings_sliderMobileUI_K2Node_ComponentBoundEvent_27_OnFloatValueChangedEvent__DelegateSignature(float Value);
	void SliderUI(float Val);
	void BndEvt__settings_fpsLow_K2Node_ComponentBoundEvent_28_click__DelegateSignature();
	void BndEvt__settings_fpsMid_K2Node_ComponentBoundEvent_29_click__DelegateSignature();
	void BndEvt__settings_fpsHigh_K2Node_ComponentBoundEvent_30_click__DelegateSignature();
	void BndEvt__settings_w_window_114_K2Node_ComponentBoundEvent_31__close__DelegateSignature();
	void ExecuteUbergraph_settings(int32 EntryPoint, class UM2save_C* CallFunc_m2save_save, class UM2save_C* CallFunc_m2save_save_1, float CallFunc_GetValue_ReturnValue, int32 CallFunc_FTrunc_ReturnValue, class UM2save_C* CallFunc_m2save_save_2, class UM2save_C* CallFunc_m2save_save_3, float CallFunc_GetValue_ReturnValue_1, class UM2save_C* CallFunc_m2save_save_4, int32 CallFunc_FTrunc_ReturnValue_1, class UM2save_C* CallFunc_m2save_save_5, class UM2save_C* CallFunc_m2save_save_6, float CallFunc_GetValue_ReturnValue_2, int64 CallFunc_FTrunc64_ReturnValue, class FText CallFunc_Conv_Int64ToText_ReturnValue, int32 CallFunc_FTrunc_ReturnValue_2, class UM2save_C* CallFunc_m2save_save_7, float CallFunc_GetValue_ReturnValue_3, int64 CallFunc_FTrunc64_ReturnValue_1, int32 CallFunc_FTrunc_ReturnValue_3, class FText CallFunc_Conv_Int64ToText_ReturnValue_1, const struct FGeometry& K2Node_Event_MyGeometry, float K2Node_Event_InDeltaTime, float CallFunc_Divide_FloatFloat_ReturnValue, bool CallFunc_Less_FloatFloat_ReturnValue, class UGameInstance* CallFunc_GetGameInstance_ReturnValue, class UM2data_C* K2Node_DynamicCast_AsM_2data, bool K2Node_DynamicCast_bSuccess, const struct FTimerHandle& CallFunc_K2_SetTimer_ReturnValue, class UM2data_C* CallFunc_game_game, class UM2data_C* CallFunc_game_game_1, bool CallFunc_EqualEqual_StrStr_ReturnValue, float K2Node_ComponentBoundEvent_Value_2, float CallFunc_Divide_FloatFloat_ReturnValue_1, int64 CallFunc_FTrunc64_ReturnValue_2, class FText CallFunc_Conv_Int64ToText_ReturnValue_2, class UM2data_C* CallFunc_game_game_2, bool CallFunc_LessEqual_FloatFloat_ReturnValue, float K2Node_ComponentBoundEvent_Value_1, float K2Node_ComponentBoundEvent_Value, class UM2data_C* CallFunc_game_game_3, float K2Node_CustomEvent_val, class UCanvasPanelSlot* CallFunc_SlotAsCanvasSlot_ReturnValue, int32 CallFunc_FTrunc_ReturnValue_4, class UM2data_C* CallFunc_game_game_4, int32 CallFunc_MakeLiteralInt_ReturnValue, class FText CallFunc_Conv_IntToText_ReturnValue, int32 CallFunc_Multiply_IntInt_ReturnValue, int32 CallFunc_Divide_IntInt_ReturnValue, int32 CallFunc_Multiply_IntInt_ReturnValue_1, float CallFunc_Conv_IntToFloat_ReturnValue, int32 CallFunc_Divide_IntInt_ReturnValue_1, int32 CallFunc_Multiply_IntInt_ReturnValue_2, float CallFunc_Conv_IntToFloat_ReturnValue_1, int32 CallFunc_Divide_IntInt_ReturnValue_2, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue, float CallFunc_Conv_IntToFloat_ReturnValue_2, int32 CallFunc_Multiply_IntInt_ReturnValue_3, int32 CallFunc_Divide_IntInt_ReturnValue_3, float CallFunc_GetValue_ReturnValue_4, float CallFunc_Conv_IntToFloat_ReturnValue_3, int32 CallFunc_FTrunc_ReturnValue_5, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue_1, bool CallFunc_isTr_tr_, bool CallFunc_isTr_tr__1);
};

}


